Repository: tuanle2021/englishapp
Catalog: src/*-learning-app-develop/*-learning-app-develop/lib/l10n/app_*.arb
Languages: vi

# textCarousel1
source: Learn new word from anytime, anywhere
vi: Học từ vừng mới mọi nơi, mọi lúc

source: Hello World!
vi: Xin chào

# signInText
source: Sign In
vi: Đăng nhập

# login_screen_welcome_text
source: Welcome to My English App
vi: Chào mừng đến với ứng dụng My English

# login_screen_welcome_text2
source: Let's get started
vi: Bắt đầu thôi!

source: Username
vi: Tên người dùng

source: Password
vi: Mật khẩu

source: Create Account
vi: Tạo tài khoản

# signUpDescriptionText
source: By choosing to continue, you agree to accept all our applicable Terms & Conditions and Privacy Policy
vi: Bằng việc tiếp tục, bạn đồng ý với Điều khoản Dịch vụ và Chính sách Bảo mật của chúng tôi

# signUpDescription
source: Don't Have an Account?
vi: Bạn chưa có tài khoản?

# signUpText
source: Sign Up
vi: Đăng ký ngay

source: Confirm Password
vi: Xác nhận lại mật khẩu

source: Or Login With
vi: Hoặc đăng nhập bằng

source: Forgot password?
vi: Quên mật khẩu?

source: Reset password
vi: Đặt lại mật khẩu

source: Send request
vi: Gửi yêu cầu

source: Login with Google
vi: Đăng nhập với tài khoản Google

source: Login with facebook
vi: Đăng nhập với tài khoản Facebook

# resetPasswordDescription
source: Enter the email associated with your account and we'll send and email with instruction to reset your password
vi: Nhập email liên kết với tài khoản của bạn, chúng mình sẽ gửi hướng dẫn đặt lại mật khẩu

source: Last name
vi: Tên

source: First name
vi: Họ

# signUpSuccess
source: Register Successfully
vi: Đăng ký thành công

# invalidCredentialLoginError
source: Login credentials is invalid
vi: Thông tin đăng nhập không chính xác

source: Something went wrong, please try again later
vi: Đã có lỗi xảy ra ra, bạn vui lòng thử lại sau

# noInternetConnection
source: Please check your internet connection and try again
vi: Kiểm tra lại tín hiệu mạng của bạn và thử lại

# connectionTimeout
source: Connection timed out
vi: Kết nối vượt quá thời gian quy định

# subjectTab
source: Subjects
vi: Chủ đề

# reviewTab
source: Review
vi: Ôn tập

# favouriteTab
source: Favourite
vi: Yêu thích

# profileTab
source: Profile
vi: Hồ sơ

# prepDataLoading
source: We're preparing the app's data for you
vi: Chúng mình đang chuẩn bị dữ liệu cho bạn

# pleaseAMomment
source: Please wait us a moment
vi: Bạn chờ chút nha

# forgotPasswordSendSuccess
source: A password recovery link has been sent to your email Please follow the link for password reset
vi: Mail chứa link đặt lạt mật khẩu được gửi thành công. Bạn làm theo đường link để lấy lại mật khẩu nhé

# emailNotBeenFound
source: This email has not been associated to any account in our system yet Please check again
vi: Email này chưa được đăng ký với tài khoản nào Bạn hãy kiểm tra lại nhé

# activatedAccount
source: Activate account
vi: Kích hoạt tài khoản

# expired
source: The code will expired in
vi: Mã kích hoạt sẽ hết hạn trong

# otpSend
source: Code is sent to email
vi: Mã kích hoạt đã được gửi đến

source: Activate
vi: Kích hoạt

# notreceivecode
source: Didn't receive the code?
vi: Không nhận được mã?

source: Resend
vi: Gửi lại

# loginSessionExpired
source: Login session expired Please login again
vi: Phiên đăng nhập đã hết hạn Vui lòng đăng nhập lại

# errorInvalidEmail
source: Invalid Email
vi: Định dạng email không hợp lệ

# errorEmptyPassword
source: Password can't be empty
vi: Mật khẩu không thể trống

# errorEmptyEmail
source: Email can't be empty
vi: Email không thể trống

# errorEmptyUserName
source: First name can't be empty
vi: Họ không thể trống

# errorMiniumPassword
source: Minimum eight characters At least one uppercase letter At lease one lowercase letter and one number
vi: Mật khẩu tối thiểu 6 ký tự thường Tối thiểu 1 ký tự in hoa Tối thiểu 1 ký tự viết hoa và 1 số

# errorPasswordMatch
source: Passwords do not match
vi: Mật khẩu xác nhận không trùng nhau

source: Sign out
vi: Đăng xuất

# areyousuretosignout
source: Are you sure you want to log out
vi: Bạn có muốn đăng xuất

source: Yes
vi: Đồng ý

source: No
vi: Từ chối

# personalInfo
source: Personal's info
vi: Thông tin cá nhân

# saveButton
source: Save
vi: Lưu

source: Linked Account
vi: Tài khoản liên kết

source: Settings
vi: Cài đặt

source: Leader Board
vi: Bảng xếp hạng

# leaderboard_nodata
source: You have no Facebook friends using this app or system got some problem
vi: Bạn chưa có bạn bè Facebook sử dụng app hoặc hệ thống đang bị lỗi

# navbar_leaderboard
source: Leader Board
vi: BXH

# leaderboard_permisson
source: Leader Board Data Permission
vi: Cho phép chia sẻ dữ liệu bảng xếp hạng

source: Feedback
vi: Phản hồi

source: General
vi: Cài đặt chung

# cropper
source: Image cropper
vi: Chỉnh sửa ảnh

source: App language
vi: Ngôn ngữ ứng dụng

# englishLanguage
source: English
vi: Tiếng Anh

# vietnameseLanguage
source: Vietnamese
vi: Tiếng Việt

source: Notifications
vi: Thông báo

# avatarUpdateUnsuccess
source: Avatar update unsuccessfully, please try again later
vi: Ảnh đại diện cập nhật không thành công

# doneButton
source: Done
vi: Hoàn thành

# cancelButton
source: Cancel
vi: Huỷ

source: App Theme
vi: Chế độ màu

# darkmode
source: Dark
vi: Nền tối

# lightmode
source: Light
vi: Nền sáng

source: System
vi: Nền hệ thống

source: Start quiz
vi: Bắt đầu ôn tập

source: Adjective
vi: Tính từ

source: Noun
vi: Danh từ

source: Verb
vi: Động từ

source: Adverb
vi: Trợ động từ

source: Pronoun
vi: Mạo từ

source: Example
vi: Ví dụ

source: Definition
vi: Nghĩa

# quizFillChar
source: Missing Chars
vi: Ký tự còn thiếu

# quizFillWord
source: Gap Fill
vi: Điền vào chỗ trống

# quizRightPronouce
source: Right Pronouce
vi: Phát âm đúng

# quizRightWord
source: Multiple Choice
vi: Câu hỏi trắc nghiệm

# quizTransArrage
source: Correct Sentence
vi: Sắp xếp và hoàn thành câu

# wordOne
source: Word 1
vi: Từ 1

# wordTwo
source: Word 2
vi: Từ 2

source: Correct
vi: Chính xác

source: Incorrect
vi: Không chính xác

source: Complete
vi: Hoàn thành

source: Next
vi: Tiếp theo

source: Which word mean...
vi: Từ nào có nghĩa là ...

source: Answer
vi: Đáp án

source: Rearrange sentence
vi: Câu sắp xếp

source: Total point:
vi: Tổng số điểm:

# correctPoint
source: Correct:
vi: Số câu đúng:

# totalQuiz
source: Total quizzes
vi: Tổng số câu

# wrongPint
source: Incorrect:
vi: Số lần sai

# trueAnswer
source: Solution
vi: Đáp án

source: Well done, keep going
vi: Làm tốt lắm! Tiếp tục phát huy nhé

# lesson
source: Lessons
vi: Bài học

source: Accuracy
vi: Độ chính xác

# lessonRelated
source: Lessons related to
vi: Các bài học liên quan đến

source: Check
vi: Kiểm tra

# fillMissingChar
source: Fill the missing chars for word below
vi: Điền ký tự còn thiếu vào từ bên dưới

# fillMissingWord
source: Choose correct word to fill the blank space
vi: Chọn từ phù hợp để điền vào chỗ trống

# chooseRightPronouce
source: Choose correct pronounciation of word
vi: Chọn từ có phát âm đúng

# chooseRightChoice
source: Choose the correct meaning
vi: Chọn nghĩa đúng

# arrangeWord
source: Translate and arrrage sentence
vi: Sắp xếp và dịch câu sau

# areYouSureProgressLost
source: Are you sure you want to quit Progress of this lesson will be lost
vi: Bạn chắc chắn sẽ thoát chứ Tiến độ của bài tập sẽ bị mất

source: Start
vi: Bắt đầu

# keepTrying
source: Keep trying, you almost get it
vi: Gần đạt rồi,Cố gắng hơn nữa nhé!!!

# veryGood
source: Congratulation, you are fully understood this lesson
vi: Thật tuyệt vời! Bạn đã hiểu bài học này tốt rồi đấy

# bad
source: Oh so bad! You need to work harder
vi: Kết quả thật tệ! Bạn cần cải thiện nhiều hơn nữa

# unlinkAccount
source: This action will unlink your account to
vi: Hành động này sẽ huỷ liên kết tài khoản bạn đến

# accountLinkAlready
source: Other account has link to this service Please try another
vi: Một tài khoản khác đã liên kết với tài khoản Vui lòng sử dụng tài khoản khác để liên kết

source: Search...
vi: Tìm kiếm...

# sortAToZ
source: Alphabetical: A-Z
vi: Chữ cái: A-Z

# sortZToA
source: Alphabetical: Z-A
vi: Chữ cái: Z-A

# sortDateNewToOld
source: Date: Newest to Oldest
vi: Ngày thêm: Mới nhất - Trễ nhất

# sortDateOldToNew
source: Date: Oldest to Newest
vi: Ngày thêm: Trễ nhất - Mới nhất

# sortCompleteNewToOld
source: Completion time: Fast - Slow
vi: Thời gian hoàn thành: Nhanh nhất - Chậm nhất

# sortCompleteOldToNew
source: Completion time: Slow - Fast
vi: Thời gian hoàn thành: Chậm nhất - Nhanh nhất

# addNewFavouriteWord
source: Add New Word
vi: Thêm từ mới

# deleteButton
source: Delete
vi: Xoá

source: Point
vi: Tổng điểm

source: Total question
vi: Tổng số câu hỏi

# totalIncorrectQuestion
source: Total incorrect
vi: Tổng số câu sai

# completedIn
source: Complete in
vi: Hoàn thành trong

source: Total word learn
vi: Số từ đã học

source: Average accuracy
vi: Độ chính xác trung bình

source: Total time spent
vi: Tổng thời gian học

# againButton
source: Again
vi: Một lần nữa

# hardButton
source: Hard
vi: Hơi khó

# goodButton
source: Good
vi: Bình thường

# easyButton
source: Easy
vi: Đơn giản

# completeLessonToHaveWord
source: Complete lesson for learning words
vi: Hoàn thành các bài học trước nhé

source: History
vi: Lịch sử

# notiTile
source: Hi it's MyVocab
vi: Xin chào, MyVocab đây

# notification1
source: Hey wake up, time to learn some english
vi: Giờ học đến rồi, giờ học đến rồi, dậy bạn ơi

# notification2
source: It's your time for your daily english, just take 5 minutes to complete it
vi: Tới giờ học từ vựng rồi, 5 phút mỗi ngày hoi bạn ơi

source: Weekday
vi: Ngày trong tuần

# sunday
source: Sun
vi: CN

source: Start at
vi: Vào lúc

source: Choose time
vi: Chọn thời gian

# askNotiTitle
source: MyVocab ask you for notification's permission
vi: MyVocab xin phép quyền thông báo đến cho bạn

# enableNotiButton
source: Enable notification
vi: Cấp quyền thông báo

# youKnowThisWord
source: Congrat, seem like you know this word properly
vi: Bạn có vẻ đã hiểu nghĩa từ này rồi đấy

# youNotKnowThisWord
source: No, it's wrong please flip card and learn again
vi: Không chính xác rồi, lật thẻ để học lại nhé

source: Synonyms
vi: Từ đồng nghĩa

# whichWordMeanVn
source: is mean...
vi: có nghĩa là...
